Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/live-installer.tmx
Source language: en
Languages: sv

source: Calculating file indexes ...
sv: Beräknar fil-index ...

source: Use LVM (Logical Volume Management)
sv: Använd LVM (logisk volymhantering)

source: Assign to /boot/efi
sv: Tilldela till /boot/efi

source: Refresh
sv: Uppdatera

source: User account
sv: Användarkonto

source: Require my password to log in
sv: Kräv mitt lösenord för att logga in

source: This field must be lower case.
sv: Fältet får bara innehålla små bokstäver.

source: Checking bootloader
sv: Kontrollerar starthanteraren

source: Warning
sv: Varning

source: Automated installation on %s
sv: Automatisk installation på %s

source: Installation paused
sv: Installationen pausad

source: Who are you?
sv: Vem är du?

source: The name it uses when it talks to other computers.
sv: Det namn som används när den pratar med andra datorer.

source: An EFI system partition is needed with the following requirements: - Mount point: /boot/efi - Partition flags: Bootable - Size: at least 35MB (100MB or more recommended) - Format: vfat or fat32 To ensure compatibility with Windows we recommend you use the first partition of the disk as the EFI system partition.
sv: Det behövs en EFI-partition med följande egenskaper: - Monteringspunkt: /boot/efi - Partitionsflaggor: Startbar - Storlek: minst 35 MB (100 MB eller mer rekommenderas) - Formatering: vfat eller fat32 För att säkerställa kompatibilitet med Windows rekommenderar vi att du använder enhetens första partition som EFI-partition.

source: Installation Type
sv: Installationstyp

source: The installation is now complete. Do you want to restart your computer to use the new system?
sv: Installationen är färdig. Vill du starta om din dator för att använda det nya systemet?

source: Location
sv: Plats

source: Where are you?
sv: Var befinner du dig?

source: Installing drivers
sv: Installerar drivrutiner

source: No partition table was found on the hard drive: %s. Do you want the installer to create a set of partitions for you? Note: This will ERASE ALL DATA present on this disk.
sv: Ingen partitionstabell hittades på enheten: %s. Vill du att installationsprogrammet ska skapa ett upplägg med partitioner åt dig? Observera: Detta kommer att RADERA ALLA DATA som finns på denna enhet.

source: Language
sv: Språk

source: This will delete all the data on %s. Are you sure?
sv: Alla data på %s kommer att raderas. Är du säker?

source: Filling %s with random data (please be patient, this can take hours...)
sv: Fyller %s med slumpmässiga data (var god ha tålamod, detta kan ta timmar...)

source: The installation is now paused. Please read the instructions on the page carefully before clicking Next to finish the installation.
sv: Installationen har pausats. Läs instruktionerna på sidan noga innan du klickar på Nästa för att slutföra installationen.

source: Writing filesystem mount information to /etc/fstab
sv: Skriver in filsystemets monteringsinformation i /etc/fstab

source: This provides extra security but it can take hours.
sv: Detta ger extra säkerhet men kan ta flera timmar.

source: Choose a password:
sv: Välj ett lösenord:

source: Erase a disk and install LMDE on it.
sv: Radera allt på enheten och installera LMDE på den.

source: The EFI partition is not bootable. Please edit the partition flags.
sv: EFI-partitionen är inte angiven som startenhet. Justera partitionsflaggorna.

source: Keyboard layout
sv: Tangentbordslayout

source: Size
sv: Storlek

source: Automatic login:
sv: Automatisk inloggning:

source: Logical partition
sv: Logisk partition

source: Disk:
sv: Enhet:

source: Pick a username:
sv: Välj ett användarnamn:

source: This field contains invalid characters.
sv: Fältet innehåller ogiltiga tecken.

source: The partition %s could not be created. The installation will stop. Restart the computer and try again.
sv: Partitionen %s kunde inte skapas. Installationen avbryts. Starta om datorn och försök igen.

source: Mount point:
sv: Monteringspunkt:

source: Operating system
sv: Operativsystem

source: Do NOT mount virtual devices such as /dev, /proc, /sys, etc on /target/.
sv: Montera INTE virtuella enheter, som /dev, /proc, /sys mm. på /target/.

source: Edit
sv: Redigera

source: Advanced options
sv: Avancerade inställningar

source: Fill the disk with random data
sv: Fyll enheten med slumpmässiga data

source: Confirm passphrase
sv: Bekräfta lösenfrasen

source: Cancel
sv: Avbryt

source: disabled
sv: inaktiverad

source: Your computer's name:
sv: Din dators namn:

source: Removable:
sv: Borttagbar:

source: The entry is too short.
sv: För få tecken.

source: Create /target/etc/fstab for the filesystems as they will be mounted in your new system, matching those currently mounted at /target (without using the /target prefix in the mount paths themselves).
sv: Skapa /target/etc/fstab för filsystemen som de kommer monteras i ditt nya system, på samma sätt som de just nu är monterade på /target (utan att använda prefixet /target i monteringssökvägarna).

source: Creating partitions on %s
sv: Skapar partitioner på %s

source: Entering the system ...
sv: Går in i systemet ...

source: The values do not match.
sv: Värdena överensstämmer inte.

source: Install bootloader on %s
sv: Installera starthanteraren på %s

source: Mounting %(partition)s on %(mountpoint)s
sv: Monterar %(partition)s på %(mountpoint)s

source: Back
sv: Bakåt

source: Encrypt the operating system
sv: Kryptera operativsystemet

source: Edit partition
sv: Redigera partition

source: Unknown
sv: Okänd

source: Please select an EFI partition.
sv: Var god välj en EFI-partition.

source: Your name:
sv: Ditt namn:

source: Welcome to %s!
sv: Välkommen till %s!

source: Before continuing, mount your target filesystem(s) on /target.
sv: Montera ditt/dina målfilssystem på /target innan du fortsätter.

source: Device
sv: Enhet

source: Manual Partitioning
sv: Manuell partitionering

source: Mount point
sv: Monteringspunkt

source: Are you sure you want to quit the installer?
sv: Är du säker på att du vill avsluta installationsprogrammet?

source: This field may not contain space characters.
sv: Fältet får inte innehålla blanktecken.

source: What is your keyboard layout?
sv: Hur ser ditt tangentbord ut?

source: Extended partition
sv: Utökad partition

source: This field cannot be empty.
sv: Fältet får inte vara tomt.

source: No
sv: Nej

source: Do not install bootloader
sv: Installera inte starthanterare

source: Expert mode
sv: Avancerat läge

source: Setting hostname
sv: Ställer in värdnamn

source: Copying /%s
sv: Kopierar /%s

source: Manually create, resize or choose partitions for LMDE.
sv: Manuella val för att skapa, storleksändra eller välja partitioner för LMDE.

source: This field cannot start or end with a hyphen or period.
sv: Det här fältet får inte börja eller sluta med bindestreck eller punkt.

source: Installing bootloader
sv: Installerar starthanterare

source: Installer
sv: Installationsprogram

source: Let's go!
sv: Sätt igång!

source: Setting keyboard options
sv: Ställer in tangentbordet

source: Automated Installation
sv: Automatisk installation

source: User settings
sv: Användarinställningar

source: The EFI partition is too small. It must be at least 35MB.
sv: EFI-partitionen är för liten. Den måste vara minst 35 MB.

source: This program will ask you some questions and set up LMDE on your computer.
sv: Programmet kommer att ställa några frågor och installera LMDE i din dator.

source: Mount %(path)s as %(mount)s
sv: Montera %(path)s som %(mount)s

source: Formatting %(partition)s as %(format)s ...
sv: Formaterar %(partition)s som %(format)s ...

source: Summary
sv: Sammanfattning

source: Username:
sv: Användarnamn:

source: The partition table couldn't be written for %s. Restart the computer and try again.
sv: Partitionstabellen för %s kunde inte skrivas. Starta om datorn och försök igen.

source: Filesystem operations
sv: Filsystemsåtgärder

source: Format %(path)s as %(filesystem)s
sv: Formatera %(path)s som %(filesystem)s

source: Configuring bootloader
sv: Konfigurerar starthanteraren

source: Quit?
sv: Avsluta?

source: You selected to manage your partitions manually, this feature is for ADVANCED USERS ONLY.
sv: Du har valt att själv göra partitioneringen. Detta bör endast göras av ERFARNA ANVÄNDARE.

source: During the install, you will be given time to chroot into /target and install any packages that will be needed to boot your new system.
sv: Under installationen får du möjlighet att köra chroot i /target och installera de paket som behövs för att starta upp ditt nya system.

source: The entry is too long.
sv: För många tecken.

source: Installing
sv: Installerar

source: Install the GRUB boot menu on:
sv: Installera GRUB-startmenyn på:

source: Please select a root (/) partition.
sv: Välj en rotpartition (/).

source: Removing live configuration (packages)
sv: Tar bort livekonfiguration (paket)

source: enabled
sv: aktiverad

source: Type
sv: Typ

source: Encrypt my home folder
sv: Kryptera min personliga mapp

source: Yes
sv: Ja

source: Quit
sv: Avsluta

source: Installation Tool
sv: Installationsverktyg

source: Free space
sv: Ledigt utrymme

source: The EFI partition must be formatted as vfat.
sv: EFI-partitionen måste vara formaterad som vfat.

source: Install
sv: Installera

source: What language would you like to use?
sv: Vilket språk vill du använda?

source: Confirm your password:
sv: Bekräfta ditt lösenord:

source: Installation error
sv: Installationsfel

source: Double-check that your /target/etc/fstab is correct, matches what your new system will have at first boot, and matches what is currently mounted at /target.
sv: Dubbelkolla att din /target/etc/fstab stämmer, innehåller vad ditt nya system kommer att ha vid första uppstart och innehåller det som nu är monterat på /target.

source: Computer's name:
sv: Datorns namn:

source: System settings
sv: Systeminställningar

source: Timezone
sv: Tidszon

source: WARNING: The grub bootloader was not configured properly! You need to configure it manually.
sv: VARNING: starthanteraren grub är felaktigt konfigurerad! Du måste konfigurera den manuellt.

source: Language:
sv: Språk:

source: Passphrase
sv: Lösenfras

source: Cleaning APT
sv: Rensar APT

source: A root partition is needed to install Linux Mint on. - Mount point: / - Recommended size: 30GB - Recommended filesystem format: ext4
sv: Det behövs en rotpartition för att installera Linux Mint Monteringspunkt: / Rekommenderad storlek: 30 GB Rekommenderat filsystem: ext4

source: Type here to test your keyboard layout
sv: Skriv här för att prova ditt tangentbord

source: Device:
sv: Enhet:

source: Setting locale
sv: Landsanpassar

source: Log in automatically
sv: Logga in automatiskt

source: Note that in order for update-initramfs to work properly in some cases (such as dm-crypt), you may need to have drives currently mounted using the same block device name as they appear in /target/etc/fstab.
sv: Observera att för att update-initramfs ska kunna fungera i en del fall (som dm-crypt) kan du behöva ha dina enheter monterade vid tillfället, med samma blockenhetsnamn som de har i /target/etc/fstab.

source: Keyboard Model:
sv: Tangentbordsmodell:

source: Format as
sv: Formatera som

source: Real name:
sv: Namn:

source: Assign to /home
sv: Tilldela till /home

source: Do the following and then click Next to finish installation:
sv: Gör följande och klicka sedan på Fortsätt för att slutföra installationen:

source: Installation finished
sv: Installationen är klar

source: Launch GParted
sv: Starta GParted

source: Where do you want to install LMDE?
sv: Var vill du installera LMDE?

source: ERROR: You must first manually mount your target filesystem(s) at /target to do a custom install!
sv: FEL: Du måste först montera målfilsystemet/målfilsystemen manuellt på /target för att utföra en anpassad installation!

source: During the install, you will be required to write your own /etc/fstab.
sv: Under installationen kommer du att behöva skriva en egen /etc/fstab.

source: Assign to /
sv: Tilldela till /

source: Localizing packages
sv: Landsanpassar paketen

source: Install any packages that may be needed for first boot (mdadm, cryptsetup, dmraid, etc) by calling "sudo chroot /target" followed by the relevant apt-get/aptitude installations.
sv: Installera de paket du behöver för första uppstarten (mdadm, cryptsetup, dmraid, osv.) genom att anropa "sudo chroot /target", följt av de relevanta apt-get-/aptitude-installationerna.

source: Partitioning
sv: Partitionering

source: Next
sv: Nästa

source: Timezone:
sv: Tidszon:

source: Keyboard layout:
sv: Tangentbordslayout:

source: Disk Encryption:
sv: Enhetskryptering:

source: Use already-mounted /target.
sv: Använd det redan monterade /target.

source: Please indicate a filesystem to format the root (/) partition with before proceeding.
sv: Välj ett filsystem att formatera rotpartitionen (/) med innan du fortsätter.

source: * Your username, your computer's name and your password should only contain Latin characters. In addition to your selected layout, English (US) is set as the default. You can switch layouts by pressing Super+Space.
sv: * Ditt användarnamn, datorns namn och ditt lösenord får bara innehålla latinska tecken. Utöver den layout du väljer är Engelska (USA) vald som standard. Du kan växla layout genom att trycka på Super+mellanslag.

source: Please choose a language
sv: Var god välj ett språk

source: Adding new user to the system
sv: Lägger till en ny användare i systemet

source: Localization
sv: Landsanpassning

source: Home encryption:
sv: Kryptering av din personliga mapp:

source: Format as:
sv: Formatera som:
